{
  "file_name": "cfcaa658c8ce4b3c8e445ac4a5de850a_IIT2024081.pdf",
  "title": "Indian Institute of Information",
  "citations": [
    "Sample vs Theoretical Moments\nThe empirical mean and variance approach theoretical values as sample size grows"
  ],
  "articles": [],
  "raw_text": "Indian Institute of Information\nTechnology, Allahabad\nProbability And Statistics\nAssignment\nSubmitted By:\nEnrollment No.: IIT2024081\nName: Sudhanshu\nBranch: Information Technology (3rd Semester) - Sec A\nSubmitted To:\nDr. Savitri Joshi\nCourse: Probability And Statistics\nDate Of Submission: 3rd November, 2025`\nStatistical Analysis Assignment\nConversion Predictors of Clinically Isolated\nSyndrome to Multiple Sclerosis\nCoding Language: R (Remainder of 081 ÷ 3 = 0 ⇒ R)\nDataset: Multiple Sclerosis Disease\nType: Discrete Data\nsize: 273\nSource: Kaggel (Multiple Sclerosis Disease)\nSelection: Since my name starts with the letter ‘S’, I selected a dataset related to\ndisease named Multiple Sclerosis Disease. The dataset captures clinical and\ndemographic predictors associated with the conversion of Clinically Isolated\nSyndrome (CIS) to Multiple Sclerosis (MS) in Mexican mestizo patients treated\nbetween 2006 and 2010 at the National Institute of Neurology and Neurosurgery,\nMexico City.\nQuestion 1: Exploratory Analysis of the CIS Dataset\nDataset Overview\n• Observations: 273 patients. Row identifiers in the source file were treated as\nrow names to preserve patient IDs without using them in computations.\n• Key variables:\n– Gender (1 = male, 2 = female).\n– Age (years at CIS diagnosis).\n– Initial_Symptom (categorised index of first clinical presentation).\n– Oligoclonal_Bands (0 = negative, 1 = positive, 2 = strongly positive /\nrepeated positivity).\n– Neurophysiological indicators (LLSSEP, ULSSEP, VEP, BAEP).\n– MRI findings across brain and spinal cord regions.\n– Disability metrics (Initial_EDSS, Final_EDSS), reported for patients who\nconverted to MS (group = 1).\n– group (1 = converted to MS, 2 = remained CIS).\n• Missingness: Schooling and Initial_Symptom each have one missing value.\nInitial_EDSS and Final_EDSS are unavailable for 148 patients (all in group = 2).\nNo other variables contain missing entries.\n• Clinical context: The combination of MRI and neurophysiological measures\nenables the joint analysis of inflammatory burden and electrophysiological\nresponse, both of which are relevant to conversion risk.\n1.2 Data Import and Cleaning\n1.3 Descriptive Statistics\nMetric Age\nMean 34.0623\nMedian 33\nMode 28\nStandard 11.1144\ndeviation\nVariance 123.529\nSkewness 0.6981\nKurtosis 0.4244\n\nOutput\n1.4 Visual Exploration\n\nObservations: -\n• Age clusters between late 20s and mid-30s, with the histogram peaking around 25-\n35 and tapering gradually toward older ages; very few observations below 20 or\nabove 60.\n• Distribution skews slightly right: a tail extends into the 60-70 range, but counts fall\nquickly. The stacked dot plot’s mean line lies just right of the median, confirming\nmild positive skew.\n• Age values are almost all integers, so the dot plot reveals “columns” of stacked\npoints at each whole age-no large gaps, suggesting consistent recording across ages.\n• The maximum stack height is modest (fewer than 15 observations per exact age),\nindicating no single age dominates the cohort.\nQuestion 2: Binomial Distribution Modelling\nBasis of Distribution Selection:\nLast digit of Enrolment Number: 1\nBinomial Distribution and Poisson approximation to Binomial..\n2.1 Sampling, PMF, and CDF Visualisations\nRandom samples from the Binomial distribution illustrate convergence behaviour.\n\n\n\n\n2.2 Sample vs Theoretical Moments\nThe empirical mean and variance approach theoretical values as sample size grows. Small-\nsample variance can oscillate around the theoretical variance, as evidenced by the 30-draw\nsample.\n2.3 Poisson Approximation to the Binomial\nObservations\n• Binomial PMFs and CDFs align closely with theory; as n grows the mass\nspreads smoothly and the CDF transitions sharpen-symmetric\nabout np when p = 0.6, skewed left/right for p = 0.3/0.9.\n• Expanded sample size tightens empirical dispersion around the theoretical\nmean and variance, mirroring the moment table, all four raw moments differ\nfrom expectations by well under 1%, demonstrating simulation stability.\n• Higher-order moment deviations increase mildly with larger n and extreme p,\nconsistent with sampling noise concentrated near the distribution boundaries.\n• Poisson overlays show a strong approximation when p = 0.3 (classic “rare\nevent” regime). The gap widens for p = 0.6 and becomes pronounced at p =\n0.9, illustrating the sensitivity of the approximation to large success\nprobabilities.\n• Overall, the grid confirms that sample moments converge to theory with\nlarger n, and that Poisson is only a good surrogate for Binomial when p is small\nwhile np remains moderate."
}